app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @user_reward = UserReward.find_by(user_id: @user.id)
        total = 0
        @user.donations.each do |donation|
            total += donation.amount
        end
            if total < 100
                @user_reward.update(reward_id: 1)
            elsif total < 250
                @user_reward.update(reward_id: 2)
            elsif total < 500
                @user_reward.update(reward_id: 3)
            elsif 500 <= total
                @user_reward.update(reward_id: 4)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "user_rewards".* FROM "user_rewards" WHERE "user_rewards"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = ?  [["user_id", 1]]
UPDATE "user_rewards" SET "reward_id" = ?, "updated_at" = ? WHERE "user_rewards"."id" = ?  [["reward_id", 4], ["updated_at", "2019-03-26 14:43:45.249293"], ["id", 1]]
UPDATE "user_rewards" SET "reward_id" = ?, "updated_at" = ? WHERE "user_rewards"."id" = ?  [["reward_id", 2], ["updated_at", "2019-03-26 14:50:45.364542"], ["id", 1]]
UPDATE "user_rewards" SET "reward_id" = ?, "updated_at" = ? WHERE "user_rewards"."id" = ?  [["reward_id", 3], ["updated_at", "2019-03-26 16:32:33.924604"], ["id", 27]]
UPDATE "user_rewards" SET "reward_id" = ?, "updated_at" = ? WHERE "user_rewards"."id" = ?  [["reward_id", 4], ["updated_at", "2019-03-26 14:50:23.863787"], ["id", 1]]